app/views/played_games/new.html.erb

SELECT "users".* FROM "users"
---

  <%= f.select :user_id, User.all.collect {|user| [user.email, user.id]} %>