app/views/games/_notfullgame.html.erb

SELECT "played_games".* FROM "played_games" WHERE "played_games"."game_id" = ?  [["game_id", 1]]
---
      <th>Confirmed (RSVP'd) Users</th>
      <th>Spots Left : <%= @game.number_of_players - @game.played_games.length %></th>