app/views/games/_showinvited.html.erb

  <tbody>
    <% current_user.played_games.each do |game| %>
---
SELECT "games".* FROM "games"
SELECT "played_games".* FROM "played_games" WHERE "played_games"."user_id" = ?  [["user_id", 1]]