app/views/games/_showhost.html.erb

SELECT "games".* FROM "games" WHERE "games"."host_id" = ?  [["host_id", 1]]
---
  <tbody>
    <% current_user.hosted_games.each do |game| %>

SELECT "played_games".* FROM "played_games" WHERE "played_games"."game_id" = ?  [["game_id", 1]]
---
        <td><%= link_to 'Cancel Game', game, method: :delete, data: { confirm: 'Are you sure?' } %></td>
        <% if game.number_of_players - 1 > game.played_games.length %>