app/views/games/_showrsvp.html.erb

SELECT "played_games".* FROM "played_games" WHERE "played_games"."user_id" = ?  [["user_id", 1]]
---
  <tbody>
    <% current_user.played_games.all.each do |played_game| %>