app/controllers/game_steps_controller.rb

	def show
		@game = Game.find(params[:game_id])
---
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", 1]]

	def update
		@game = Game.find(params[:game_id])
		params[:game][:status] = step
		params[:game][:status] = 'active' if step == steps.last
		@game.update(game_params)
---
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "games" SET "status" = ?, "address" = ?, "notes" = ?, "date_and_time" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["status", "active"], ["address", "here"], ["notes", "asdasd"], ["date_and_time", "2015-04-16 09:00:00.000000"], ["updated_at", "2015-04-24 16:48:27.805374"], ["id", 1]]