app/controllers/games_controller.rb

INSERT INTO "games" ("shattered_empire", "shards_of_the_throne", "number_of_players", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["shattered_empire", "f"], ["shards_of_the_throne", "f"], ["number_of_players", 2], ["status", "status"], ["created_at", "2015-04-24 20:07:48.282332"], ["updated_at", "2015-04-24 20:07:48.282332"]]
---
  def create
    @game = Game.new(game_params)
    @game.status = "status"
    respond_to do |format|
      if @game.save

DELETE FROM "games" WHERE "games"."id" = ?  [["id", 2]]
---
  def destroy
    @game.destroy