app/controllers/played_games_controller.rb

INSERT INTO "played_games" ("game_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["game_id", 1], ["user_id", 1], ["created_at", "2015-04-30 23:24:32.681270"], ["updated_at", "2015-04-30 23:24:32.681270"]]
---
  def create
    @played_game = PlayedGame.new(played_game_params)
    respond_to do |format|
      if @played_game.save

UPDATE "played_games" SET "rsvp" = ?, "updated_at" = ? WHERE "played_games"."id" = ?  [["rsvp", "t"], ["updated_at", "2015-05-05 16:51:55.994704"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @played_game.update(played_game_params)

DELETE FROM "played_games" WHERE "played_games"."id" = ?  [["id", 6]]
---
  def destroy
    @played_game.destroy

SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", nil]]
SELECT  "played_games".* FROM "played_games" WHERE "played_games"."id" = ? LIMIT 1  [["id", 6]]
---
    def set_played_game
      @played_game = PlayedGame.find(params[:id])